src/cf/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>CNSS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМобильногоКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДМобильногоУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/ФизическиеЛица/ManagerModule.bsl
Функция СформироватьПредставлениеДляПечати(Сотрудник) Экспорт
	Возврат СокрЛП(Сотрудник.Фамилия) + 
		?(ЗначениеЗаполнено(Сотрудник.Имя), " " + Лев(Сотрудник.Имя, 1) + ".", "") + 
		?(ЗначениеЗаполнено(Сотрудник.Отчество), " " + Лев(Сотрудник.Отчество, 1) + ".", "");	
КонецФункции

Функция ПолучитьПоКодуМобильногоКлиента(КодМобильногоКлиента) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                      |ГДЕ
	                      |	ФизическиеЛица.КодМобильногоКлиента = &КодМобильногоКлиента
	                      |	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("КодМобильногоКлиента", КодМобильногоКлиента);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.ФизическиеЛица.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции 

Функция ПолучитьПоИДМобильногоУстройства(ИДМобильногоУстройства) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФизическиеЛица.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                      |ГДЕ
	                      |	ФизическиеЛица.ИДМобильногоУстройства = &ИДМобильногоУстройства
	                      |	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("ИДМобильногоУстройства", ИДМобильногоУстройства);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.ФизическиеЛица.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции
